willie68/ArduinoTPS_Boards/ArduinoTPS/avr/boards.txt
TinyTPS.name=TinyTPS
TinyTPS.bootloader.tool=arduino:avrdude
TinyTPS.bootloader.unlock_bits=0xff
TinyTPS.bootloader.lock_bits=0xff
TinyTPS.bootloader.low_fuses=0xfe
TinyTPS.bootloader.high_fuses=0xdf
TinyTPS.bootloader.extended_fuses=0xff

TinyTPS.build.core=arduino:arduino
TinyTPS.build.board=TinyTPS
TinyTPS.build.mcu=attiny84
TinyTPS.build.variant=TinyTPS
TinyTPS.build.f_cpu=8000000L

TinyTPS.upload.tool=arduino:avrdude
TinyTPS.upload.maximum_size=8192

ArduinoTPS.name=ArduinoTPS
ArduinoTPS.bootloader.tool=arduino:avrdude
ArduinoTPS.bootloader.low_fuses=0xFF
ArduinoTPS.bootloader.unlock_bits=0x3F
ArduinoTPS.bootloader.lock_bits=0x0F
ArduinoTPS.bootloader.high_fuses=0xDA
ArduinoTPS.bootloader.extended_fuses=0xFD

ArduinoTPS.build.board=ArduinoTPS
ArduinoTPS.build.mcu=atmega328p
ArduinoTPS.build.f_cpu=16000000L
ArduinoTPS.build.core=arduino:arduino
ArduinoTPS.build.variant=ArduinoTPS

ArduinoTPS.upload.tool=arduino:avrdude
ArduinoTPS.upload.maximum_size=30720
ArduinoTPS.upload.maximum_data_size=2048
ArduinoTPS.upload.speed=57600
